In [12]:
import pandas as pd

In [59]:
ratings = pd.read_csv('ratings.csv')
ratings.head(2)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247

In [60]:
ratings.groupby(['rating']).count()

        userId  movieId  timestamp
rating
0.5       1370     1370       1370
1.0       2811     2811       2811
1.5       1791     1791       1791
2.0       7551     7551       7551
2.5       5550     5550       5550
3.0      20047    20047      20047
3.5      13136    13136      13136
4.0      26818    26818      26818
4.5       8551     8551       8551
5.0      13211    13211      13211

In [61]:
movies = pd.read_csv('movies.csv')
movies.head(2)

   movieId             title                                       genres
0        1  Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
1        2    Jumanji (1995)                   Adventure|Children|Fantasy

In [62]:
movies.shape

(9742, 3)

In [63]:
ratings.merge(movies, on = 'movieId', how = 'outer').shape

(100854, 6)

In [66]:
ratings.shape

(100836, 4)

In [64]:
movies[movies['movieId'] ==3456]

      movieId                                         title genres
2587     3456  Color of Paradise, The (Rang-e khoda) (1999)  Drama

In [65]:
ratings[ratings['movieId'] ==3456]

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []

In [57]:
ratings = pd.read_csv('ratings_example.txt', sep = '\t')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [19]:
movies = pd.read_csv('movies_example.txt', sep = '\t')
movies.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [20]:
ratings.merge(movies, on = 'movieId', how = 'left')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [21]:
ratings.merge(movies, on = 'movieId', how = 'right')

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
2,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

In [22]:
ratings.merge(movies, on = 'movieId', how = 'inner')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [23]:
ratings.merge(movies, on = 'movieId', how = 'outer')

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
2,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

In [24]:
items_dict = {
    'item_id'    : [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 
    'vendor'     : ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
}

In [25]:
purchase_log = {
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id'    : [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 
    'price'      : [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
}

In [27]:
items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)

In [30]:
pd.merge(purchase_df, items_df, how='outer', on='item_id')

    purchase_id  item_id    price   vendor  stock_count
0         101.0   417283  13900.0  Samsung         54.0
1         101.0   849734   5330.0       LG         33.0
2         101.0   132223  38200.0    Apple        122.0
3         112.0   573943  49990.0    Apple         18.0
4         121.0    19475   9890.0       LG        102.0
5         145.0  3294095  33000.0    Apple         43.0
6         145.0   382043  67500.0  Samsung         77.0
7         145.0   302948  34500.0  Samsung        143.0
8         145.0   103845  89900.0      NaN          NaN
9         221.0   100132  11400.0       LG         60.0
10          NaN   312394      NaN      ZTE         19.0

In [32]:
merged = pd.merge(purchase_df, items_df, how='inner', on='item_id')
merged.shape

(9, 5)

In [38]:
merged2 = pd.merge(purchase_df, items_df, how='inner', on='item_id')
merged2['income'] = merged2['price'] * merged2['stock_count']
merged2.sort_values('income',ascending=False)

   purchase_id  item_id  price   vendor  stock_count   income
6          145   382043  67500  Samsung           77  5197500
7          145   302948  34500  Samsung          143  4933500
2          101   132223  38200    Apple          122  4660400
5          145  3294095  33000    Apple           43  1419000
4          121    19475   9890       LG          102  1008780
3          112   573943  49990    Apple           18   899820
0          101   417283  13900  Samsung           54   750600
8          221   100132  11400       LG           60   684000
1          101   849734   5330       LG           33   175890

In [39]:
merged2['income'].sum()

19729490

In [40]:
import os

In [41]:
files = os.listdir('data')
files

['ratings_8.txt',
 'ratings_9.txt',
 'ratings_10.txt',
 'ratings_7.txt',
 'ratings_6.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_1.txt',
 'ratings_2.txt',
 'ratings_3.txt']

In [43]:
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']
files_new = []
for file in files:
    if file.contains('.txt') == True:
        files_new = files_new.append(file)
files_new

AttributeError: 'str' object has no attribute 'contains'

In [50]:
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']
files1 = pd.Series(files)

files_new = files1[files1.str.contains('.txt')].to_list()

files_new

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [49]:
files_new?

In [54]:
files = os.listdir('data')
data = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])

for file in files:
    temp = pd.read_csv(os.path.join('data', file), names = ['userId', 'movieId', 'rating', 'timestamp'] )
    data = pd.concat([data, temp])

data.shape

(100004, 4)